pipeline {
    // Определяем, на каком агенте будет выполняться пайплайн.
    // 'any' означает, что можно использовать любой доступный агент.
    agent any

    // Секция 'tools' для определения инструментов, которые будут использоваться в пайплайне.
    tools {
        // Используем ранее настроенные JDK и Maven
        jdk 'JDK_21'
        maven 'Maven_3.8.7'
    }

    // Определяем этапы пайплайна
    stages {
        stage('Run API Tests') {
            steps {
                // Выполняем команду Maven для запуска тестов.
                // Jenkins автоматически склонирует ваш репозиторий в рабочую директорию,
                // поэтому команда `mvn` будет выполнена в корне вашего проекта.
                sh 'mvn clean test'
            }
        }
    }
}
